<?php
/**
 * 错误信息定义和获取类
 * Created by PhpStorm.
 * User: Administrator
 * Date: 2016/4/5
 * Time: 15:49
 */

class GetErrMsg
{
    protected $_msgArr = [
        '10000' => ['登录失败','登录失败'],
        '10001' => ['无效参数','无效参数'],
        '10002' => ['请输入有效密码','请输入有效密码'],
        '10003' => ['用户名不存在','用户名或密码不正确'],
        '10004' => ['两次输入密码不一致','两次输入密码不一致'],
        '10005' => ['密码不正确','用户名或密码不正确'],
        '10006' => ['(password)不能为空','用户名或密码不正确'],
        '10007' => ['用户名太长','用户名或密码不正确'],
        '10008'  => ['用户名不正确','用户名或密码不正确'],
        '10009'  => ['用户名不能为空','用户名或密码不正确'],
        '10010' => ['用户名已存在','用户名已存在'],
        '10011' => ['用户不存在','用户不存在'],
        '10013' => ['(userId)参数不正确','用户不存在'],
        '10015' => ['Email格式不正确','Email格式不正确'],
        '10016' => ['Tel格式不正确','手机号格式不正确'],
        '10018' => ['验证码不正确','验证码错误不正确'],
        '10021' => ['图片描述不能为空','图片描述不能为空'],
        '10024' => ['(picCat)参数无效','图片分类不存在'],
        '10027' => ['(thumbnail)参数不能为空','请选择需要上传的图片'],
        '10030' => ['(type)参数无效','请填写有效的数据'],
        '10033' => ['您输入的内容太长','您输入的内容太长'],
        '10036' => ['(send_name)参数无效','请输入有效的商户名称'],
        '10039' => ['(redpack_type)参数无效','请输入有效的红包类型'],
        '10042' => ['(amount_min)参数无效','请输入有效的红包金额'],
        '10043' => ['(amount_max)参数无效','请输入有效的红包金额'],
        '10045' => ['(activity_amount)参数无效','请输入有效的红包金额'],
        '10048' => ['(activity_amount)参数无效','活动金额不能少于红包金额'],
        '10051' => ['(total_num)参数无效','请输入有效的红包发放总人数'],
        '10054' => ['(wishing)参数无效','请输入有效的祝福'],
        '10057' => ['(act_name)参数无效',PARAM_ERROR_PROMPT],
        '10058' => ['(scene_id)参数无效',PARAM_ERROR_PROMPT],
        '10060' => ['(remark)参数无效',PARAM_ERROR_PROMPT],
        '10061' => ['(action)参数无效',PARAM_ERROR_PROMPT],
        '10062' => ['(activity_marking)参数无效',PARAM_ERROR_PROMPT],
        '10063' => ['文章删除失败','文章删除失败'],
        '10065' => ['你选择的文章不存在','你选择的文章不存在'],
        '10066' => ['(id)参数无效','请选择有效的项'],
        '10069' => ['分类信息不存在','分类信息不存在'],
        '10080' => ['(title)参数无效','文章标题不能为空'],
        '10083' => ['(is_top)参数无效','请选择是否置顶'],
        '10086' => ['(thumbnail_url)参数无效','请输入有效的的URL值'],
        '10089' => ['(keywords)参数无效','请输入有效的的关键字值'],
        '10092' => ['(content)参数无效','文章内容不符合规范,请检查!'],
        '10100' => ['(open_id)参数无效',PARAM_ERROR_PROMPT],
        '10103' => ['(auth)参数无效',PARAM_ERROR_PROMPT],
        '10106' => ['(article_id)参数无效',PARAM_ERROR_PROMPT],
        '10110' => ['(is_active)参数无效',PARAM_ERROR_PROMPT],
        '10112' => ['(job_name)参数无效',PARAM_ERROR_PROMPT],
        '10114' => ['(out_page_url)参数无效',PARAM_ERROR_PROMPT],
        '10116' => ['(department_id)参数无效',PARAM_ERROR_PROMPT],
        '10118' => ['(order_sort)参数无效',PARAM_ERROR_PROMPT],
        '10120' => ['()参数无效',PARAM_ERROR_PROMPT],
        '10122' => ['()参数无效',PARAM_ERROR_PROMPT],
        '10200' => ['包含非法的文件类型','包含非法的文件类型'],
        '10403' => ['您误入了他国领地,请赶快离开，危险！','您误入了他国领地,请赶快离开，危险！'],
        '10404' => ['您没有权限操作','您没有权限操作'],
        '20000' => ['数据添加失败','数据添加失败'],
        '20001' => ['添加用户失败','添加用户失败'],
        '20004' => ['添加分类失败','添加分类失败'],
        '20008' => ['选择的分类不存在','选择的分类不存在'],
        '20030' => ['文章发布失败','文章发布失败'],
        '20032' => ['图片添加失败','图片添加失败'],
        '20038' => ['密码修改失败','密码修改失败'],
        '20040' => ['添加活动失败','添加活动失败'],
        '20043' => ['更新微信OPENID失败','更新微信OPENID失败'],
        '20046' => ['获取微信用户信息失败','获取微信用户信息失败'],
        '20048' => ['更新微信用户信息失败','更新微信用户信息失败'],
        '20052' => ['您查询的活动信息不存在','您查询的活动信息不存在'],
        '20054' => ['关闭活动失败','关闭活动失败'],
        '20055' => ['活动已过期，无法启用','活动已过期，无法启用'],
        '20056' => ['存在活动冲突，请先关闭与之存在冲突的活动','存在活动冲突，请先关闭与之存在冲突的活动'],
        '20058' => ['启用活动失败','启用活动失败'],
        '21901' => ['更新信息失败,请重试!','更新信息失败,请重试!'],
        '21903' => ['添加信息失败,请重试!','添加信息失败,请重试!'],
        '21905' => ['获取信息失败,请重试!','获取信息失败,请重试!'],
        '21907' => ['图片上传失败!','图片上传失败!'],
        '21909' => ['同步微信素材失败!','同步微信素材失败!'],
        '21911' => ['菜单不能为空!','菜单不能为空!'],
        '21913' => ['菜单名不能为空且长度不能超过5个字符!','菜单名不能为空或长度超过5个字符!'],
        '21915' => ['菜单类型不能为空!','菜单类型不能为空!'],
        '21917' => ['菜单(p_id)不能为空!','菜单层级不能为空!'],
        '21919' => ['菜单(key)不能为空!','菜单关键字不能为空!'],
        '21921' => ['菜单(urk)不能为空!','菜单关键字不能为空!'],
    ];


    public function __construct(){}


    /**
     * 获得提示信息
     * @param $errno
     * @param int $isShowMsg
     * @return string
     */
    public function getErrMsg($errno, $isShowMsg = 1)
    {
        /*if($this->config->system->debugModel == 1){
            //开启调试模试后显示真实的错误信息
            $errmsg = $this->_msgArr[$errno][0];
        }else{
            //未开启调试模试显示优化后（对用户友好的）的错误信息
            $errmsg = $this->_msgArr[$errno][1];
        }*/

        $errmsg = $this->_msgArr[$errno][0];
        //是否展示错误信息
        if ($isShowMsg == 0) {
            $msg = ['status'=>0,'errno'=>$errno];
        }else{
            $msg = ['status'=>0,'errno'=>$errno,'errmsg'=>$errmsg];
        }

        return $msg;
    }
}

